# BuiltInFailures.ElectricalFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures Class
BuiltInFailures Class Members See Also
---
Failures about Electricity.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ElectricalFailures
```

Visual Basic
---
```text
Public NotInheritable Class ElectricalFailures
```

Visual C++
---
```text
public ref class ElectricalFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ElectricalFailures
# See Also
BuiltInFailures..::..ElectricalFailures Members
Autodesk.Revit.DB Namespace